backend/app/controllers/users_controller.rb

    def create
        user = User.new(user_params)
        user.starsign = (Starsign.all.find{|starsign| starsign.name == user.zodiac_sign})

        # how to assign the star sign
        # user.errors.full_messages
        user.save
---
SELECT "starsigns".* FROM "starsigns"
INSERT INTO "users" ("username", "email", "dob", "starsign_id", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"