app/controllers/starsigns_controller.rb

SELECT "starsigns".* FROM "starsigns"
---
    def index
        starsigns = Starsign.all